src/Catalogs/ПечатныеФормы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ПечатныеФормы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПечатнаяФормаПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПечатныеФормы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПодключенныеФормы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Макет</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Процедура</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonForms/ФормаВыбораПечатныхФорм/module.bsl
Перем ПечатнаяФормаПоУмолчанию;
Перем ПодчиненныйСправочник;
Перем СправочникОбъектИмя;

Процедура ПосмотретьНажатие(Элемент)
	Вывели=Ложь;
	Для каждого ПФ Из СписокМакетовПечати Цикл
		Если ПФ.Пометка Тогда
			Вывели=Истина;
			Если ПФ.Значение.Родитель<>Справочники.ПечатныеФормы["Справочник"+СправочникОбъектИмя] Тогда
				Объект=ПодчиненныйСправочник.ПолучитьОбъект();
			Иначе
				Объект=КлючУникальности.ПолучитьОбъект();
			КонецЕсли;
			Объект.Печать(ПФ.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ Вывели Тогда
		Если ЭлементыФормы.СписокМакетовПечати.ТекущиеДанные=Неопределено Тогда
			Предупреждение("Печатная форма не указана");
			Возврат;
		Иначе
			Если ЭлементыФормы.СписокМакетовПечати.ТекущиеДанные.Значение.Родитель<>Справочники.ПечатныеФормы["Справочник"+СправочникОбъектИмя] Тогда
				Объект=ПодчиненныйСправочник.ПолучитьОбъект();
			Иначе
				Объект=КлючУникальности.ПолучитьОбъект();
			КонецЕсли;
			Объект.Печать(ЭлементыФормы.СписокМакетовПечати.ТекущиеДанные.Значение);
		КонецЕсли;
	КонецЕсли;
	Закрыть();
КонецПроцедуры

Процедура ПечатьНажатие(Элемент)
	Вывели=Ложь;
	Для каждого ПФ Из СписокМакетовПечати Цикл
		Если ПФ.Пометка Тогда
			Вывели=Истина;
			Если ПФ.Значение.Родитель<>Справочники.ПечатныеФормы["Справочник"+СправочникОбъектИмя] Тогда
				Объект=ПодчиненныйСправочник.ПолучитьОбъект();
			Иначе
				Объект=КлючУникальности.ПолучитьОбъект();
			КонецЕсли;
			Объект.Печать(ПФ.Значение,Истина);
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ Вывели Тогда
		Если ЭлементыФормы.СписокМакетовПечати.ТекущиеДанные=Неопределено Тогда
			Предупреждение("Печатная форма не указана");
			Возврат;
		Иначе
			Если ЭлементыФормы.СписокМакетовПечати.ТекущиеДанные.Значение.Родитель<>Справочники.ПечатныеФормы["Справочник"+СправочникОбъектИмя] Тогда
				Объект=ПодчиненныйСправочник.ПолучитьОбъект();
			Иначе
				Объект=КлючУникальности.ПолучитьОбъект();
			КонецЕсли;
			Объект.Печать(ЭлементыФормы.СписокМакетовПечати.ТекущиеДанные.Значение,Истина);
		КонецЕсли;
	КонецЕсли;
	Закрыть();

КонецПроцедуры

Процедура ПоУмолчаниюНажатие(Элемент)
	Если ЭлементыФормы.СписокМакетовПечати.ТекущиеДанные=Неопределено Тогда
		Предупреждение("Печатная форма не указана");
	ИначеЕсли ЭлементыФормы.СписокМакетовПечати.ТекущиеДанные.Значение.Родитель<>Справочники.ПечатныеФормы["Справочник"+СправочникОбъектИмя] Тогда
		Предупреждение("Эта печатная форма не может быть назначена по умолчанию");
	Иначе
		Если ЭлементыФормы.СписокМакетовПечати.ТекущиеДанные.Значение.Родитель.ПечатнаяФормаПоУмолчанию=ЭлементыФормы.СписокМакетовПечати.ТекущиеДанные.Значение Тогда
			ПечатнаяФормаПоУмолчанию=ЭлементыФормы.СписокМакетовПечати.ТекущиеДанные.Значение;
			Спр=ПечатнаяФормаПоУмолчанию.Родитель.ПолучитьОбъект();
			Спр.ПечатнаяФормаПоУмолчанию=Неопределено;
			Спр.Записать();
		Иначе
			ПечатнаяФормаПоУмолчанию=ЭлементыФормы.СписокМакетовПечати.ТекущиеДанные.Значение;
			Спр=ПечатнаяФормаПоУмолчанию.Родитель.ПолучитьОбъект();
			Спр.ПечатнаяФормаПоУмолчанию=ПечатнаяФормаПоУмолчанию;
			Спр.Записать();
		КонецЕсли;
		ПечатнаяФормаПоУмолчанию=ИнтерфейсАдмина.ПечатнаяФормаПоУмолчанию(КлючУникальности);
		ИнтерфейсАдмина.СформироватьМенюПечать(КлючУникальности,ВладелецФормы,Новый Действие("ОсновныеДействияФормыПечатьПоУмолчанию"));
	КонецЕсли;

КонецПроцедуры

Процедура ИзменитьНажатие(Элемент)
	Если ЭлементыФормы.СписокМакетовПечати.ТекущиеДанные=Неопределено Тогда
		Предупреждение("Печатная форма не указана");
	Иначе
		ОткрытьЗначение(ЭлементыФормы.СписокМакетовПечати.ТекущиеДанные.Значение);
		Закрыть();
	КонецЕсли;

КонецПроцедуры

Процедура ДобавитьНажатие(Элемент)
	Форма=Справочники.ПечатныеФормы.ПолучитьФормуНовогоЭлемента("ФормаЭлемента",ВладелецФормы,ВладелецФормы);
	Форма.Родитель=Справочники.ПечатныеФормы["Справочник"+СправочникОбъектИмя];
	Форма.Открыть();

КонецПроцедуры

Процедура СписокМакетовПечатиВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	Если ВыбраннаяСтрока.Значение.Родитель<>Справочники.ПечатныеФормы["Справочник"+СправочникОбъектИмя] Тогда
		Объект=ПодчиненныйСправочник.ПолучитьОбъект();
	Иначе
		Объект=КлючУникальности.ПолучитьОбъект();
	КонецЕсли;
	Объект.Печать(ВыбраннаяСтрока.Значение);
	Закрыть();

КонецПроцедуры

Процедура СписокМакетовПечатиПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	Если ДанныеСтроки.Значение=ПечатнаяФормаПоУмолчанию Тогда
		ОформлениеСтроки.Шрифт = Новый Шрифт(,,Истина);
	КонецЕсли;
	Если ДанныеСтроки.Значение.Предопределенный и
		ДанныеСтроки.Значение.Родитель<>Справочники.ПечатныеФормы["Справочник"+СправочникОбъектИмя] Тогда
		ОформлениеСтроки.ЦветТекста = ЦветаСтиля.ЦветГиперссылки;
	ИначеЕсли ДанныеСтроки.Значение.Предопределенный Тогда
		ОформлениеСтроки.ЦветТекста = ЦветаСтиля.ЦветТекстаПоля;
	КонецЕсли;

КонецПроцедуры

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	// Получить объект метаданных (переданный форме)
	Объект = КлючУникальности;
	Заголовок = "Печать: " + Объект;
	
	ПечатнаяФормаПоУмолчанию=ИнтерфейсАдмина.ПечатнаяФормаПоУмолчанию(Объект);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПечатныеФормы.Ссылка КАК Ссылка,
	               |	ПечатныеФормы.Код КАК Код,
	               |	ПечатныеФормы.Наименование
	               |ИЗ
	               |	Справочник.ПечатныеФормы КАК ПечатныеФормы
	               |ГДЕ
	               |	ПечатныеФормы.Родитель = &Родитель
	               |	И (НЕ ПечатныеФормы.ПометкаУдаления)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Код";
	
	СправочникОбъектИмя=Объект.Метаданные().Имя;
	ГруппаПечатныхФорм=Справочники.ПечатныеФормы["Справочник"+СправочникОбъектИмя];
	Запрос.УстановитьПараметр("Родитель",ГруппаПечатныхФорм);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		// Есть условные печатные формы, проверим эти условия
		Если ТипЗнч(Объект) = Тип("СправочникОбъект.Товары") Тогда
			Если глВерсия = 1 Тогда
				Если Выборка.Ссылка=Справочники.ПечатныеФормы.МенюСПереводом
					ИЛИ Выборка.Ссылка=Справочники.ПечатныеФормы.МенюСоСпецификами Тогда
					Продолжить;
				КонецЕсли;
				
			ИначеЕсли НЕ Константы.ДопЯзыки.Получить() 
				И Выборка.Ссылка=Справочники.ПечатныеФормы.МенюСПереводом Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;	  
		
		ТекСтрока=СписокМакетовПечати.Добавить(Выборка.Ссылка,Выборка.Наименование);
		Если ПечатнаяФормаПоУмолчанию=Выборка.Ссылка Тогда
			ЭлементыФормы.СписокМакетовПечати.ТекущаяСтрока=ТекСтрока;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
